'''
Условие
Дана строка, состоящая из слов, разделенных пробелами. Определите, сколько в ней слов. 
Используйте для решения задачи функцию `count`
'''
#**************************************************
s = input()
print(s.count(' ') + 1)

