# Напишите программу, которая принимает на вход целое число, которое обозначает количество чисел, которые нужно ввести.
# Далее программа должна считывать числа, по одному в строке, и после первого введенного нуля выводить сумму полученных на вход чисел.
# При решении задачи обратите внимание на то, что после указанного числа ввода может следовать несколько нулей.


# Sample Input 1:

# 3
# 1
# 2
# 3
# Sample Output 1:

# 6
# Sample Input 2:

# 2
# 1
# 2
# 0
# 5
# Sample Output 2:

# 3

# a=int(input())
# b=int(input())
# c=int(input())
# d=int(input())
# print(a+b+c+d)

# a=int(input())
# b=int(input())
# c=int(input())
# d=int(input())
# print(a+b+c+d)

# a=int(input())
# b=int(input())
# c=int(input())
# d=int(input())
# print(a+b+c+d)

# a=int(input())
# b=int(input())
# c=int(input())
# d=int(input())
# print(a+b+c+d)

# a=int(input())
# b=int(input())
# c=int(input())
# d=int(input())
# print(a+b+c+d)

# a=int(input())
# b=int(input())
# c=int(input())
# d=int(input())
# print(a+b+c+d)

# a=int(input())
# b=int(input())
# c=int(input())
# d=int(input())
# print(a+b+c+d)

a=int(input())
b=int(input())
c=int(input())
d=int(input())
print(a+b+c+d)
