

def main():
    b = input()  # получаем ввод пользователя
    if b == 'A':  # проверяем ввод пользователя на равенство строке
        print('T')  # выводим результат в консоль
    elif b == 'T':  # проверяем ввод пользователя на равенство строке
        print('A')  # выводим результат в консоль
    elif b == 'C':  # проверяем ввод пользователя на равенство строке
        print('G')  # выводим результат в консоль
    elif b == 'G':  # проверяем ввод пользователя на равенство строке
        print('C')  # выводим результат в консоль

if __name__ == '__main__':
    main()
