
# Последовательность состоит из натуральных чисел и завершается числом 0. Определите, какое наибольшее число подряд идущих элементов этой последовательности равны друг другу.
#
# Формат ввода
#
# Вводится последовательность целых чисел, оканчивающаяся числом 0 (само число 0 в последовательность не входит, а служит как признак ее окончания).
#
# Формат вывода
#
# Выведите ответ на задачу.
#
# Примеры
#
# Тест 1
# Входные данные:
# 1
# 7
# 9
# 9
# 9
# 9
# 0
#
# Вывод программы:
# 4
#
#
#
# Тест 2
# Входные данные:
# 1
# 2
# 1
# 1
# 2
# 0
#
# Вывод программы:
# 2
#
#
#
# Тест 3
# Входные данные:
# 1
# 1
# 1
# 1
# 1
# 0
#
# Вывод программы:
# 5
#
#
#
# Тест 4
# Входные данные:
# 1
# 2
# 3
# 1
# 3
# 0
#
# Вывод программы:
# 1
