

# a = int(input())
# print(a + a**2 + a**3)

# a = int(input())
# b = int(input())
# c = int(input())
# p = (a + b + c) / 2
# print((p * (p - a) * (p - b) * (p - c)) ** 0.5)

a = int(input()) # количество студентов в группе
b = int(input()) # количество яблок
c = int(input()) # количество бананов
print(b // a) # количество яблок на студента
print(c // a) # количество бананов на студента
print(b % a) # остаток от деления количества яблок на количество студентов
print(c % a) # остаток от деления количества бананов на количество студентов
