# Напишите программу, которая считывает целое число и выводит текст, аналогичный приведенному в примере (пробелы важны!).
# Нельзя пользоваться конкатенацией строк, используйте print с несколькими параметрами.
# Ввод: 179
# Вывод:
# 179
# 179
# 179

a = int(input())
print(a, a, a, sep='\n')

# Напишите программу, которая считывает целое число и выводит текст, аналогичный приведенному в примере (пробелы важны!).
# Нельзя пользоваться конкатенацией строк, используйте print с несколькими параметрами.
# Ввод: 179
# Вывод:
# 179
# 179
# 179

a = int(input())
print(a, a, a, sep='\n')

# Напишите программу, которая считывает целое число и выводит текст, аналогичный приведенному в примере (пробелы важны!).
# Нельзя пользоваться конкатенацией строк, используйте print с несколькими параметрами.
# Ввод: 179
# Вывод:
# 179
# 179
# 179

a = int(input())
print(a, a, a, sep='\n')

# Напишите программу, которая считывает целое число и выводит текст, аналогичный приведенному в примере (пробелы важны!).
# Нельзя пользоваться конкатенацией строк, используйте print с несколькими параметрами.
# Ввод: 179
# Вывод:
# 179
# 179
# 179

a = int(input())
print(a, a, a, sep='\n')


















































































































































































































































































































































































































































































x = int(input())
year = 0
balance = 100
while balance < x:
    balance += balance // 100
    year += 1
print(year)
