

def main():
    a = int(input())  # вводим первое число
    b = int(input())  # вводим второе число

    if a == 1 and b == 2:  # проверка на введенные числа
        print(3)  # вывод результата
    elif a == 1 and b == 3:  # проверка на введенные числа
        print(2)  # вывод результата
    elif a == 2 and b == 1:  # проверка на введенные числа
        print(3)  # вывод результата
    elif a == 2 and b == 3:  # проверка на введенные числа
        print(1)  # вывод результата
    elif a == 3 and b == 1:  # проверка на введенные числа
        print(2)  # вывод результата
    elif a == 3 and b == 2:  # проверка на введенные числа
        print(1)  # вывод результата

if __name__ == "__main__":
    main()
