#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Time    : 2018/11/14 17:36
# @Author  : fans
# @File    : file.py
# @Software: PyCharm Community Edition
# @Notice  : Copyright(c) 2018 Asiainfo Technologies Co., Ltd.
# All rights reserved.
import os

# path=r'C:\Users\Administrator\Desktop\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新建文件夹\新
