
#-----------------------------------------------------------------------------------------------------

#-----------------------------------------------------------------------------------------------------
#-----------------------------------------------------------------------------------------------------

def main():
    n = input() # число
    n = int(n)
    l = len(str(n)) # количество цифр в числе
    if l == 1 and n % 25 == 0:
        print(0)
        return
    if l == 2 and (n % 25 == 0 or (n % 10 == 0 and n // 10 % 25 == 0)): # если последние две цифры кратны 25 или последняя кратна 10 и предпоследняя кратна 25
        print(1)
        return
    if l == 2: # если последние две цифры не кратны 25 или последняя не кратна 10 и предпоследняя не кратна 25
        print(-1)
        return
    if l == 3: # если последние три цифры кратны 100 и предпоследняя кратна 25
        if n % 100 == 0 and n // 100 % 25 == 0:
            print(1)
            return
        if n % 100 % 25 == 0: # если последние две цифры кратны 25
            print(2)
            return
        if n // 100 % 25 == 0: # если предпоследняя цифра кратна 25
            print(1)
            return
        print(-1)
        return
    s = 0 # сумма цифр
    moves = 0 # количество ходов
    for i in range(l - 1, -1, -1): # цикл от последней цифры до первой
        s += int(str(n)[i])
        if s % 25 == 0: # если сумма цифр кратна 25
            moves += l - i # добавляем количество цифр к ходам
            s = 0 # сбрасываем сумму цифр
            l = i + 1 # обновляем количество цифр
    if s == 0: # если сумма цифр равна нулю
        print(moves)
        return
    print(-1)

if __name__ == '__main__':
    main()
